#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/55d3be31-4d42-42c1-8129-a75a80d3140b/resourceGroups/rg-module-dinkol]
module.storage.azurerm_storage_account.account: Refreshing state... [id=/subscriptions/55d3be31-4d42-42c1-8129-a75a80d3140b/resourceGroups/rg-module-dinkol/providers/Microsoft.Storage/storageAccounts/moduledinkostorage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.resource-group.azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id         = "/subscriptions/55d3be31-4d42-42c1-8129-a75a80d3140b/resourceGroups/rg-module-dinkol" -> (known after apply)
      ~ name       = "rg-module-dinkol" -> "rg-module-dinkoli" # forces replacement
      - tags       = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.storage.azurerm_storage_account.account must be replaced
-/+ resource "azurerm_storage_account" "account" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/55d3be31-4d42-42c1-8129-a75a80d3140b/resourceGroups/rg-module-dinkol/providers/Microsoft.Storage/storageAccounts/moduledinkostorage" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "moduledinkostorage"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://moduledinkostorage.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "moduledinkostorage.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://moduledinkostorage.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "moduledinkostorage.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://moduledinkostorage.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "moduledinkostorage.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "westeurope" -> (known after apply)
      ~ primary_queue_endpoint             = "https://moduledinkostorage.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "moduledinkostorage.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://moduledinkostorage.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "moduledinkostorage.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://moduledinkostorage.z6.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "moduledinkostorage.z6.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "rg-module-dinkol" -> "rg-module-dinkoli" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      - tags                               = {} -> null
        # (21 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ resource_group_name = "rg-module-dinkol" -> "rg-module-dinkoli"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @dinkol, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform plan and apply with OIDC auth`*